import matplotlib.pyplot as plt
import os

# 自己给定的 x 和 y 值
# x1 = [1.036605, 1.03618, 1.038065, 1.046065, 1.056255, 1.073585, 1.093455, 1.109575, 1.12851, 1.154905]
# y1 = [3.083185, 2.69979, 2.362305, 2.06206, 1.819005, 1.668915, 1.548525, 1.49174, 1.556675, 1.72631]  # y1 = x^2
# z1 = [1.571745, 1.471865, 1.36605, 1.270855, 1.206555, 1.169875, 1.149955, 1.132845, 1.148815, 1.17444]
# x2 = [1.307365, 1.21661, 1.183395, 1.153105, 1.112625, 1.08526, 1.05878, 1.03352, 1.01647, 1.00376]
# y2 = [1, 1.07651, 1.11942, 1.178805, 1.275935, 1.404425, 1.57439, 1.75788, 2.092545, 2.462725]  # y2 = x^3
# z2 = [1, 1.014275, 1.025335, 1.04136, 1.07298, 1.10758, 1.15805, 1.214075, 1.29999, 1.37702]

x1 = [1.03597, 1.0382, 1.04407, 1.0506, 1.0627, 1.08583, 1.11316, 1.14085, 1.18243, 1.22101]
y1 = [5.13188, 3.48674, 2.91445, 2.44793, 2.09027, 1.87663, 1.74169, 1.63147, 1.74116, 1.80602]  # y1 = x^2
z1 = [1.90342, 1.5907, 1.45424, 1.3215, 1.24103, 1.182, 1.15488, 1.13742, 1.14194, 1.15981]
x2 = [1.307365, 1.21661, 1.183395, 1.153105, 1.112625, 1.08526, 1.05878, 1.03352, 1.01647, 1.00376]
y2 = [1, 1.10091, 1.15199, 1.22188, 1.33957, 1.49248, 1.72674, 1.93992, 2.44851, 2.93417]  # y2 = x^3
z2 = [1, 1.02191, 1.03437, 1.05258, 1.0838, 1.12267, 1.18775, 1.26206, 1.36548, 1.49398]

# 创建图形
plt.figure(figsize=(5, 5), dpi=150)  # 设置图形大小

# # 绘制第一条曲线
# plt.plot(x1, y1, label="OAPDII", color="red", linestyle="-", marker="o")

# # # 绘制第二条曲线
# plt.plot(x2, y2, label="OASALT", color="blue", linestyle="-", marker="o")

# # 绘制第一条曲线
plt.plot(x1, z1, label="OAPDII", color="red", linestyle="-", marker="o")

# # # 绘制第二条曲线
plt.plot(x2, z2, label="OASALT", color="blue", linestyle="-", marker="o")

# 添加标题和标签
# plt.xlabel("Lightness")
# plt.ylabel("Shallowness")

# #添加标题和标签
plt.xlabel("Lightness")
plt.ylabel("Normalized path length")

# 添加图例
plt.legend()

# # 显示网格
# plt.grid(True)

# 显示图形
dir = "figure"
if not os.path.exists(dir):
    os.mkdir(dir)

# plt.savefig(os.path.join(dir, "SL2.pdf"))
plt.savefig(os.path.join(dir, "PL2.pdf"))